throughput_tests/results_monohilo_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            10000

Document Path:          /index.html
Document Length:        20224 bytes

Concurrency Level:      100
Time taken for tests:   0.159 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      20268000 bytes
HTML transferred:       20224000 bytes
Requests per second:    6296.75 [#/sec] (mean)
Time per request:       15.881 [ms] (mean)
Time per request:       0.159 [ms] (mean, across all concurrent requests)
Transfer rate:          124631.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       2
Processing:     1   14   3.2     15      21
Waiting:        0   14   3.2     15      21
Total:          3   15   2.8     15      21

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     16
  75%     16
  80%     17
  90%     17
  95%     17
  98%     20
  99%     21
 100%     21 (longest request)