throughput_tests/results_monohilo_50.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            10000

Document Path:          /index.html
Document Length:        20224 bytes

Concurrency Level:      50
Time taken for tests:   0.149 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      20268000 bytes
HTML transferred:       20224000 bytes
Requests per second:    6692.99 [#/sec] (mean)
Time per request:       7.470 [ms] (mean)
Time per request:       0.149 [ms] (mean, across all concurrent requests)
Transfer rate:          132474.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    7   1.2      7      10
Waiting:        0    7   1.2      7      10
Total:          1    7   1.1      7      10

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      7
  75%      8
  80%      8
  90%      8
  95%      9
  98%     10
  99%     10
 100%     10 (longest request)