throughput_tests/results_monohilo_5000.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            10000

Document Path:          /index.html
Document Length:        20224 bytes

Concurrency Level:      5000
Time taken for tests:   0.941 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      101340000 bytes
HTML transferred:       101120000 bytes
Requests per second:    5310.79 [#/sec] (mean)
Time per request:       941.479 [ms] (mean)
Time per request:       0.188 [ms] (mean, across all concurrent requests)
Transfer rate:          105116.36 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   16  30.7      0      83
Processing:     9  153  44.9    167     213
Waiting:        0  153  45.0    167     213
Total:         92  168  23.4    169     225

Percentage of the requests served within a certain time (ms)
  50%    169
  66%    176
  75%    179
  80%    181
  90%    196
  95%    204
  98%    214
  99%    220
 100%    225 (longest request)