throughput_tests/results_multihilo_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            15000

Document Path:          /index.html
Document Length:        20225 bytes

Concurrency Level:      1000
Time taken for tests:   0.134 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      20269000 bytes
HTML transferred:       20225000 bytes
Requests per second:    7490.19 [#/sec] (mean)
Time per request:       133.508 [ms] (mean)
Time per request:       0.134 [ms] (mean, across all concurrent requests)
Transfer rate:          148260.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   20   5.0     18      28
Processing:    39   73  12.0     74      94
Waiting:        0   72  13.2     74      94
Total:         39   93   7.4     92     107

Percentage of the requests served within a certain time (ms)
  50%     92
  66%     97
  75%     99
  80%    100
  90%    104
  95%    106
  98%    107
  99%    107
 100%    107 (longest request)