throughput_tests/results_multihilo_15000.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            15000

Document Path:          /index.html
Document Length:        19725 bytes

Concurrency Level:      15000
Time taken for tests:   10.235 seconds
Complete requests:      15000
Failed requests:        0
Total transferred:      296535000 bytes
HTML transferred:       295875000 bytes
Requests per second:    1465.55 [#/sec] (mean)
Time per request:       10235.077 [ms] (mean)
Time per request:       0.682 [ms] (mean, across all concurrent requests)
Transfer rate:          28293.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 3367 2350.3   3266   10013
Processing:    86 1522 1298.4   1166    4574
Waiting:        0  119  64.1    106    1212
Total:       1513 4890 2324.0   4285   10099

Percentage of the requests served within a certain time (ms)
  50%   4285
  66%   4885
  75%   7384
  80%   7697
  90%   8108
  95%  10079
  98%  10090
  99%  10095
 100%  10099 (longest request)