throughput_tests/results_multihilo_17500.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            15000

Document Path:          /index.html
Document Length:        19725 bytes

Concurrency Level:      17500
Time taken for tests:   13.721 seconds
Complete requests:      17500
Failed requests:        0
Total transferred:      345957500 bytes
HTML transferred:       345187500 bytes
Requests per second:    1275.42 [#/sec] (mean)
Time per request:       13720.999 [ms] (mean)
Time per request:       0.784 [ms] (mean, across all concurrent requests)
Transfer rate:          24622.78 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 6373 3803.1   4676   13407
Processing:   150 3020 2804.1   1961    8317
Waiting:        0  218  94.6    211     398
Total:       5032 9393 2817.7   8694   13649

Percentage of the requests served within a certain time (ms)
  50%   8694
  66%  10928
  75%  11598
  80%  11752
  90%  13581
  95%  13628
  98%  13641
  99%  13646
 100%  13649 (longest request)