throughput_tests/results_multihilo_200.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            15000

Document Path:          /index.html
Document Length:        20225 bytes

Concurrency Level:      200
Time taken for tests:   0.082 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      20269000 bytes
HTML transferred:       20225000 bytes
Requests per second:    12174.19 [#/sec] (mean)
Time per request:       16.428 [ms] (mean)
Time per request:       0.082 [ms] (mean, across all concurrent requests)
Transfer rate:          240975.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    7   1.1      7       9
Processing:     0    8   1.3      8      18
Waiting:        0    4   1.9      4      12
Total:          5   15   1.3     15      27

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     16
  75%     16
  80%     16
  90%     17
  95%     17
  98%     18
  99%     18
 100%     27 (longest request)